app/Controllers/Dashboard.php

   public function index()
{
    $db = \Config\Database::connect();

    // 🔹 Pattadar dropdown
    $pattadarList = $db->table('land_records')
        ->select('pattadar_name')
        ->distinct()
        ->orderBy('pattadar_name', 'ASC')
        ->get()
        ->getResultArray();
---
SELECT DISTINCT `pattadar_name`
FROM `land_records`
ORDER BY `pattadar_name` ASC

public function pattadarDetails()
{
    $db = \Config\Database::connect();

    // 🔹 Pattadar dropdown (distinct)
    $pattadarList = $db->table('land_records')
        ->select('pattadar_name')
        ->distinct()
        ->orderBy('pattadar_name', 'ASC')
        ->get()
        ->getResultArray();

    // 🔹 Filters
    $pattadar = $this->request->getPost('pattadar_name');
    $khata    = $this->request->getPost('khata_no');

    $builder = $db->table('land_records');

    if ($pattadar) {
        $builder->where('pattadar_name', $pattadar);
    }
    if ($khata) {
        $builder->where('khata_no', $khata);
    }

    $records = [];
    if ($pattadar || $khata) {
        $records = $builder->orderBy('id', 'DESC')->get()->getResultArray();
---
SELECT DISTINCT `pattadar_name`
FROM `land_records`
ORDER BY `pattadar_name` ASC
SELECT *
FROM `land_records`
WHERE `pattadar_name` = 'Golla Philip/Golla Anjineyulu'
ORDER BY `id` DESC